Tekla Open API Reference for Tekla Structures 2025
PourBreak.PourBreakAttributes.HiddenLines Property
 The hidden line type of the pour break.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineTypeAttributes HiddenLines { get; set; }
Public Property HiddenLines As LineTypeAttributes
	Get
	Set
Property Value
Type: LineTypeAttributes
See Also
Reference
PourBreak.PourBreakAttributes Class
Tekla.Structures.Drawing Namespace